In [1]:
import pandas as pd
import numpy as np

In [2]:
## reading the csv file
d1=pd.read_csv('ex1.csv')

In [3]:
d1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
## reading the csv file
d1=pd.read_csv('ex1.csv',header=None)

In [5]:
d1

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [ ]:
pwd

In [ ]:
## passing the absolute path
d2=pd.read_csv(r"/Users/dms/Documents/12th july classroom/Pandas/Examples for file reading/ex1.csv")

In [ ]:
d2

In [6]:
## reading tab separated 
d3=pd.read_table('test.tsv')

In [7]:
d3

            test     test   test.1   test.2   test.3
Data        Data     Data     Data     Data     Data
Science  Science  Science  Science  Science  Science

In [ ]:
## reading tab separated file with csv 
d4=pd.read_csv('test.tsv',sep='\t')

In [ ]:
d4

In [12]:
d5=pd.read_csv('ex7.csv',sep='*',header=None)

In [13]:
d5

   0  1  2
0  a  b  c
1  1  2  3
2  1  2  3

In [14]:
type(d5)

pandas.core.frame.DataFrame

In [16]:
d1.head(2) ## first five rows from the dataframe

   0  1  2  3        4
0  a  b  c  d  message
1  1  2  3  4    hello

In [17]:
d1.tail(2) ## last 5 rows of the dataframe.

   0   1   2   3      4
2  5   6   7   8  world
3  9  10  11  12    foo

In [18]:
## reading row inside row
d6=pd.read_csv('csv_mindex.csv')

In [19]:
d6

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [20]:
d6=pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])

In [21]:
d6

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
## Checking null or NAN or na-->
##considered as missing values in ML

d8=pd.read_csv('ex5.csv')

In [23]:
d8

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
d8.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [25]:
## getting the total number of null present 
## in particular column
d8.isnull().sum()

something    0
a            0
b            0
c            1
d            0
message      1
dtype: int64

In [38]:
d9=pd.read_csv('ex5.csv',na_values=['three'])

In [39]:
d9

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2       NaN  9  10  11.0  12     foo

In [40]:
## Reading the excel file
d10=pd.read_excel('ex1.xlsx')

In [41]:
d10

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [42]:
d11=pd.read_excel('ex1.xlsx',sheet_name='XYA')

In [43]:
d11

   1  2  3  3.1
0  4  5  6    9
1  7  8  5    2

In [ ]:
pwd

In [45]:
## reading html data
d1=pd.read_html('https://www.basketball-reference.com/leagues/NBA_2015.html')

In [46]:
type(d1)

list

In [50]:
len(d1)

11

In [49]:
d1[0]

,Eastern Conference,W,L,W/L%,GB,PS/G,PA/G,SRS
0,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division
1,Toronto Raptors*,49,33,.598,—,104.0,100.9,2.45
2,Boston Celtics*,40,42,.488,9.0,101.4,101.2,-0.40
3,Brooklyn Nets*,38,44,.463,11.0,98.0,100.9,-3.13
4,Philadelphia 76ers,18,64,.220,31.0,92.0,101.0,-9.04
5,New York Knicks,17,65,.207,32.0,91.9,101.2,-9.50
6,Central Division,Central Division,Central Division,Central Division,Central Division,Central Division,Central Division,Central Division
7,Cleveland Cavaliers*,53,29,.646,—,103.1,98.7,4.08
8,Chicago Bulls*,50,32,.610,3.0,100.8,97.8,2.54
9,Milwaukee Bucks*,41,41,.500,12.0,97.8,97.4,-0.09
10,Indiana Pacers,38,44,.463,15.0,97.3,97.0,-0.23
11,Detroit Pistons,32,50,.390,21.0,98.5,99.5,-1.39
12,Southeast Division,Southeast Division,Southeast Division,Southeast Division,Southeast Division,Southeast Division,Southeast Division,Southeast Division
13,Atlanta Hawks*,60,22,.732,—,102.5,97.1,4.75
14,Washington Wizards*,46,36,.561,14.0,98.5,97.8,0.17
15,Miami Heat,37,45,.451,23.0,94.7,97.3,-2.92
16,Charlotte Hornets,33,49,.402,27.0,94.2,97.3,-3.44
17,Orlando Magic,25,57,.305,35.0,95.7,101.4,-5.87

In [51]:
d2=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [52]:
d2

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [54]:
d2[1]

IndexError: list index out of range

In [55]:
## reading json file
d3=pd.read_json('example.json')

In [56]:
d3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
D1

In [ ]:
## saving data
D1=d2[0]
D2=D1.to_csv('htmldata.csv')

In [59]:
D2=d1[0]

In [60]:
D2

,Eastern Conference,W,L,W/L%,GB,PS/G,PA/G,SRS
0,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division,Atlantic Division
1,Toronto Raptors*,49,33,.598,—,104.0,100.9,2.45
2,Boston Celtics*,40,42,.488,9.0,101.4,101.2,-0.40
3,Brooklyn Nets*,38,44,.463,11.0,98.0,100.9,-3.13
4,Philadelphia 76ers,18,64,.220,31.0,92.0,101.0,-9.04
5,New York Knicks,17,65,.207,32.0,91.9,101.2,-9.50
6,Central Division,Central Division,Central Division,Central Division,Central Division,Central Division,Central Division,Central Division
7,Cleveland Cavaliers*,53,29,.646,—,103.1,98.7,4.08
8,Chicago Bulls*,50,32,.610,3.0,100.8,97.8,2.54
9,Milwaukee Bucks*,41,41,.500,12.0,97.8,97.4,-0.09
10,Indiana Pacers,38,44,.463,15.0,97.3,97.0,-0.23
11,Detroit Pistons,32,50,.390,21.0,98.5,99.5,-1.39
12,Southeast Division,Southeast Division,Southeast Division,Southeast Division,Southeast Division,Southeast Division,Southeast Division,Southeast Division
13,Atlanta Hawks*,60,22,.732,—,102.5,97.1,4.75
14,Washington Wizards*,46,36,.561,14.0,98.5,97.8,0.17
15,Miami Heat,37,45,.451,23.0,94.7,97.3,-2.92
16,Charlotte Hornets,33,49,.402,27.0,94.2,97.3,-3.44
17,Orlando Magic,25,57,.305,35.0,95.7,101.4,-5.87

In [61]:
D2.to_csv('ABC.csv')

In [62]:
pwd

'/Users/dms/Documents/12th july classroom/Pandas/Examples for file reading'